benchmark/old_outputs/thread_equals_client/sieve/uni_2/2026-04-19T22:21:44-04:00_1_1_1.5.txt
pgbench (19devel)
transaction type: multiple scripts
scaling factor: 1000
query mode: simple
number of clients: 2
number of threads: 2
maximum number of tries: 1
duration: 180 s
number of transactions actually processed: 1239686
number of failed transactions: 0 (0.000%)
latency average = 0.290 ms
initial connection time = 1.795 ms
tps = 6887.200728 (without initial connection time)
SQL script 1: pgscripts/uniform_select.sql
 - weight: 1 (targets 50.0% of total)
 - 620406 transactions (50.0% of total)
 - number of transactions actually processed: 620406 (tps = 3446.728167)
 - number of failed transactions: 0 (0.000%)
 - latency average = 0.145 ms
 - latency stddev = 0.184 ms
SQL script 2: pgscripts/uniform_update.sql
 - weight: 1 (targets 50.0% of total)
 - 619218 transactions (49.9% of total)
 - number of transactions actually processed: 619218 (tps = 3440.128113)
 - number of failed transactions: 0 (0.000%)
 - latency average = 0.436 ms
 - latency stddev = 0.524 ms
ratio: .6661755201998882